facebookincubator/oculus-linux-kernel/drivers/staging/oculus/mcu/swd/swd_registers_nrf5340.h
/* SPDX-License-Identifier: GPL-2.0 */
#ifndef _SWD_REGISTERS_NRF5340_H
#define _SWD_REGISTERS_NRF5340_H

#define SWD_NRF5340_NVMC_APP_BASE 0x40039000
#define SWD_NRF5340_NVMC_SECURE_BASE 0x50039000
#define SWD_NRF5340_NVMC_NET_BASE 0x41080000

#define SWD_NRF5340_NVMC_READY_OFFSET 0x400
#define SWD_NRF5340_NVMC_READY_NEXT_OFFSET 0x400
#define SWD_NRF5340_NVMC_CONFIG_OFFSET 0x504
#define SWD_NRF5340_NVMC_ERASEALL_OFFSET 0x50C
#define SWD_NRF5340_NVMC_ERASEPARTIAL_OFFSET 0x51C
#define SWD_NRF5340_NVMC_CONFIGNS_OFFSET 0x584
#define SWD_NRF5340_NVMC_WRITEUICRNS_OFFSET 0x588

#define SWD_NRF5340_NVMC_CONFIG_REN 0
#define SWD_NRF5340_NVMC_CONFIG_WEN (1 << 0)
#define SWD_NRF5340_NVMC_CONFIG_EEN (1 << 1)

#define SWD_NRF5340_NVMC_READY_Busy (0 << 0)
#define SWD_NRF5340_NVMC_READY_Ready (1 << 0)

#define SWD_NRF5340_NVMC_ERASEUICR_NoOp (0 << 0)
#define SWD_NRF5340_NVMC_ERASEUICR_Start (1 << 0)

#define SWD_NRF5340_NVMC_NET_CONFIG (SWD_NRF5340_NVMC_NET_BASE + SWD_NRF5340_NVMC_CONFIG_OFFSET)
#define SWD_NRF5340_NVMC_NET_READY (SWD_NRF5340_NVMC_NET_BASE + SWD_NRF5340_NVMC_READY_OFFSET)
#define SWD_NRF5340_NVMC_SECURE_CONFIG (SWD_NRF5340_NVMC_SECURE_BASE + SWD_NRF5340_NVMC_CONFIG_OFFSET)
#define SWD_NRF5340_NVMC_SECURE_READY (SWD_NRF5340_NVMC_SECURE_BASE + SWD_NRF5340_NVMC_READY_OFFSET)

#define SWD_NRF5340_NVMC_ERASEPAGE_VALUE 0xFFFFFFFF
#define SWD_NRF5340_NVMC_SECURE_START_ADDR 0x00000000
#define SWD_NRF5340_NVMC_NET_START_ADDR 0x01000000

/*
 * DP APSEL values to choose the Access Port
 * These values are defined in DAP section:
 * https://infocenter.nordicsemi.com/topic/ps_nrf5340/debugandtrace.html?cp=3_0_0_7_0#dap
 */
#define SWD_NRF5340_APSEL_APP_MEMAP 0x00
#define SWD_NRF5340_APSEL_NET_MEMAP 0x01
#define SWD_NRF5340_APSEL_APP_CTRLAP 0x02
#define SWD_NRF5340_APSEL_NET_CTRLAP 0x03

/* CTRL-AP registers */
#define SWD_NRF5340_APREG_RESET 0x000
#define SWD_NRF5340_APREG_RESET_Reset (1)
#define SWD_NRF5340_APREG_RESET_NoReset (0)
#define SWD_NRF5340_APREG_ERASEALL 0x004
#define SWD_NRF5340_APREG_ERASEALL_Start (1)
#define SWD_NRF5340_APREG_ERASEALL_NoOperation (0)
#define SWD_NRF5340_APREG_ERASEALLSTATUS 0x008
#define SWD_NRF5340_APREG_ERASEALLSTATUS_Busy (1)
#define SWD_NRF5340_APREG_ERASEALLSTATUS_Ready (0)
#define SWD_NRF5340_APREG_APPROTECT_DISABLE 0x010
#define SWD_NRF5340_APREG_SECUREAPPROTECT_DISABLE 0x014
#define SWD_NRF5340_APREG_ERASEPROTECT_STATUS 0x018
#define SWD_NRF5340_APREG_ERASEPROTECT_Disabled (1)
#define SWD_NRF5340_APREG_ERASEPROTECT_Enabled (0)
#define SWD_NRF5340_APREG_ERASEPROTECT_DISABLE 0x01C

/* UICR Registers */
#define SWD_NRF5340_UICR_APP_BASE 0x00FF8000
#define SWD_NRF5340_UICR_APP_APPROTECT_OFFSET 0x000
#define SWD_NRF5340_UICR_APP_SECUREAPPROTECT_OFFSET 0x01C
#define SWD_NRF5340_UICR_APP_ERASEPROTECT_OFFSET 0x020

#define SWD_NRF5340_UICR_NET_BASE 0x01FF8000
#define SWD_NRF5340_UICR_NET_APPROTECT_OFFSET 0x000
#define SWD_NRF5340_UICR_NET_ERASEPROTECT_OFFSET 0x004
#define SWD_NRF5340_UICR_NET_CUSTOMER_OFFSET 0x300

#define SWD_NRF5340_UICR_APPROTECT_Disable 0x50FA50FA

/* FICR Registers */
#define SWD_NRF5340_FICR_APP_BASE 0x00FF0000
#define SWD_NRF5340_FICR_NET_BASE 0x01FF0000

#define SWD_NRF5340_FICR_PART_OFFSET 0x20C
#define SWD_NRF5340_FICR_VARIANT_OFFSET 0x210

/* Reset Registers */
#define SWD_NRF5340_RESET_APP_SECURE_BASE 0x50005000

#define SWD_NRF5340_RESET_NETWORK_FORCEOFF_OFFSET 0x614
#define SWD_NRF5340_RESET_NETWORK_FORCEOFF_Release (0 << 0)
#define SWD_NRF5340_RESET_NETWORK_FORCEOFF_Hold (1 << 0)

#define SWD_NRF5340_RESET_APP_SECURE_NETWORK_FORCEOFF (SWD_NRF5340_RESET_APP_SECURE_BASE + SWD_NRF5340_RESET_NETWORK_FORCEOFF_OFFSET)

#endif // _SWD_REGISTERS_NRF5340_H
